app/controllers/parameters_controller.rb

  def index
    @administration_menu_style = 'active'
    @list_parameters_menu_style = 'current'

    @parameter = Parameters.first
---
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def update
    @administration_menu_style = 'active'
    @list_parameters_menu_style = 'current'
    sill_amount = params[:parameters][:sill_amount]
    @parameter = Parameters.first
    if not_a_number?(sill_amount)
      flash[:error] = "Le montant seuil de rémunération doit être numérique."
    else
      @parameter.update_attributes(sill_amount: sill_amount.to_f)
---
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1
UPDATE "parameters" SET "sill_amount" = $1, "updated_at" = $2 WHERE "parameters"."id" = 1  [["sill_amount", 500000.0], ["updated_at", "2017-05-27 00:02:03.309728"]]